# Автомобиль движется со скоростью n км в день. Сколько дней ему понадобится, чтобы проехать m км
# n = 700
# m = 750

#n = 700
#m = 1400
#print(m/n)
#print((m+n-1)//n)
#print()


#Задача 3: Три новых класса (20, 21 и 22 ученика) надо оборудовать партами. Какое минимальное количество парт необходимо?

a = 20
b = 21
c = 22

print((a+1)//2+(b+1)//2+(c+1)//2)

#5. Вагоны в электричке пронумерованы натуральными числами, начиная с 1 (при этом иногда вагоны нумеруются от «головы» поезда, 
# а иногда – с «хвоста»; это зависит от того, в какую сторону едет электричка). В каждом вагоне написан его номер. 
# Витя сел в i-й вагон от головы поезда и обнаружил, что его вагон имеет номер j. Он хочет определить, сколько всего вагонов в электричке. 
# Напишите программу, которая будет это делать или сообщать, что без дополнительной информации это сделать невозможно.

#**Input:**

#3
#4

#**Output:**

#6


#Решение:

i = int(input("Ввод i: "))
j = int(input("Ввод J: "))

if i==j:
    print("Данных недостаточно")
else:
    print(f"Результат: {i+j-1}")