#Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
#Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
#а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

#*Пример:*
#6 -> 1  4  1
#24 -> 4  16  4
#    60 -> 10  40  10

#Решение:
S = 24
p = S//6
k = (S//6+S//6)*2
s = p
print(p, k, s)
#или можно короче
#S=24
#print(S//6, S//6*4, S//6)